[
    {
        "source": "CR",
        "name": "Acid Arrow",
        "tier": 2,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Far",
        "description": "You conjure a corrosive bolt that hits one foe, dealing 1d6 damage a round. The bolt remains in the target for as long as you focus."
    },
    {
        "source": "CR",
        "name": "Alarm",
        "tier": 1,
        "spellType": "Wizard",
        "duration": "1 day",
        "range": "Close",
        "description": "Send a strobing orb of energy streaking toward a target within range. Choose an energy type from fire, cold, or electricity. The orb deals 3d8 damage and delivers a concussive blast of the chosen energy type. If the energy type is anathema to the target's existence, the orb deals double damage to it."
    },
    {
        "source": "CR",
        "name": "Animate Dead",
        "tier": 3,
        "spellType": "Wizard",
        "duration": "1 day",
        "range": "Close",
        "description": "You touch one humanoid’s remains, and it rises as a zombie or skeleton under your control. The remains must have at least three limbs and its head intact. The undead creature acts on your turn. After 1 day, the creature collapses into grave dust."
    },
    {
        "source": "CR",
        "name": "Antimagic Shell",
        "tier": 5,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Self",
        "description": "An invisible, near-sized cube of null-magic appears centered on you. Within the cube, no spells can be cast. Magic items and spells have no effect in the zone, and no magic can enter. The cube moves with you. Spells such as dispel magic have no effect on it. Another antimagic shell does not affect this one."
    },
    {
        "source": "CR",
        "name": "Arcane Eye",
        "tier": 4,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Near",
        "description": "You conjure an invisible, grape-sized eye within range. You can see through the eye. It can see in the dark out to near range, fly near on your turn, and squeeze through openings as narrow as a keyhole."
    },
    {
        "source": "CR",
        "name": "Bless",
        "tier": 2,
        "spellType": "Priest",
        "duration": "Instant",
        "range": "Close",
        "description": "One creature you touch gains a luck token."
    },
    {
        "source": "CR",
        "name": "Blind/Deafen",
        "tier": 2,
        "spellType": "Priest",
        "duration": "Focus",
        "range": "Near",
        "description": "You utter a divine censure, blinding or deafening one creature you can see in range. The creature has disadvantage on tasks requiring the lost sense."
    },
    {
        "source": "CR",
        "name": "Burning Hands",
        "tier": 1,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Close",
        "description": "You spread your fingers with thumbs touching, unleashing a circle of flame that roars out to a close area around where you stand. Creatures within the area of effect take 1d6 damage, and flammable objects catch fire."
    },
    {
        "source": "CR",
        "name": "Cleansing Weapon",
        "tier": 2,
        "spellType": "Priest",
        "duration": "5 rounds",
        "range": "Close",
        "description": "One weapon you touch is wreathed in purifying flames. It deals an additional 1d4 damage (1d6 vs. undead) for the duration."
    },
    {
        "source": "CR",
        "name": "Cloudkill",
        "tier": 4,
        "spellType": "Wizard",
        "duration": "5 rounds",
        "range": "Far",
        "description": "A putrid cloud of yellow poison fills a near-sized cube within range. It spreads around corners. Creatures inside the cloud are blinded and take 2d6 damage at the beginning of their turns. A creature of LV 9 or less that ends its turn fully inside the cloud dies."
    },
    {
        "source": "CR",
        "name": "Command",
        "tier": 3,
        "spellType": "Priest",
        "duration": "Focus",
        "range": "Far",
        "description": "You issue a verbal command to one creature in range who can understand you. The command must be one word, such as “kneel.” The target obeys the command for as long as you focus. If your command is ever directly harmful to the creature, it may make a Charisma check vs. your last spellcasting check. On a success, the spell ends."
    },
    {
        "source": "CR",
        "name": "Commune",
        "tier": 4,
        "spellType": "Priest",
        "duration": "Instant",
        "range": "Self",
        "description": "You seek your god's counsel. Ask the GM up to three yes or no questions. The GM truthfully answers \"yes\" or \"no\" to each. If you cast this spell more than once in 24 hours, treat a failed spellcasting check for it as a critical failure, instead."
    },
    {
        "source": "CR",
        "name": "Confusion",
        "tier": 4,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Near",
        "description": "You mesmerize one creature you can see in range. The target can't take actions, and it moves in a random direction on its turn. If the target is LV 9+, it may make a WIS check vs. your last spellcasting check at the start of its turn to end the spell."
    },
    {
        "source": "CR",
        "name": "Control Water",
        "tier": 4,
        "spellType": "Priest, Wizard",
        "duration": "Focus",
        "range": "Far",
        "description": "You move and shape water. You can cause a section of water up to 100 feet in width and depth to change shape, defy gravity, or flow in a different direction."
    },
    {
        "source": "CR",
        "name": "Create Undead",
        "tier": 5,
        "spellType": "Wizard",
        "duration": "1 day",
        "range": "Close",
        "description": "You conjure a vengeful undead creature to do your bidding. When you cast this spell, you choose to summon either a wight or wraith. It appears next to you and is under your control. The undead creature acts on your turn. After 1 day, it melts away into smoke."
    },
    {
        "source": "CR",
        "name": "Cure Wounds",
        "tier": 1,
        "spellType": "Priest",
        "duration": "Instant",
        "range": "Close",
        "description": "Your touch restores ebbing life. Roll a number of d6s equal to 1 + half your level (rounded down). One target you touch regains that many hit points."
    },
    {
        "source": "CR",
        "name": "Detect Magic",
        "tier": 1,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Near",
        "description": "You can sense the presence of magic within near range for the spell's duration. If you focus for two rounds, you discern its general properties. Full barriers block this spell."
    },
    {
        "source": "CR",
        "name": "Detect Thoughts",
        "tier": 2,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Near",
        "description": "You peer into the mind of one creature you can see within range. Each round, you learn the target’s immediate thoughts. On its turn, the target makes a Wisdom check vs. your last spellcasting check. If the target succeeds, it notices your presence in its mind and the spell ends. \"Magic is simply the art of doing and undoing.\" -Creeg, human wizard"
    },
    {
        "source": "CR",
        "name": "Disintegrate",
        "tier": 5,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Far",
        "description": "A green ray shoots from your finger and turns a creature or object into ash. A target creature of LV 5 or less instantly dies. If it is LV 6+, it takes 3d8 damage, instead. A non-magical object up to the size of a large tree is destroyed."
    },
    {
        "source": "CR",
        "name": "Dispel Magic",
        "tier": 3,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Near",
        "description": "End one spell that affects one target you can see in range."
    },
    {
        "source": "CR",
        "name": "Divine Vengeance",
        "tier": 5,
        "spellType": "Priest",
        "duration": "10 rounds",
        "range": "Self",
        "description": "You become the divine avatar of your god's wrath, wreathed in holy flames or a black aura of smoldering corruption. For the spell's duration, you can fly a near distance, your weapons are magical, and you have a +4 bonus to your weapon attacks and damage."
    },
    {
        "source": "CR",
        "name": "Dominion",
        "tier": 5,
        "spellType": "Priest",
        "duration": "10 rounds",
        "range": "Near",
        "description": "Mighty beings come to your aid. The beings must have a combined total of 16 levels or less. Chaotic PCs summon demons/devils, and lawful or neutral PCs summon angels. The beings act of free will to aid you on your turn. After 10 rounds, they return to their realms. You cannot cast this spell again until you complete penance."
    },
    {
        "source": "CR",
        "name": "Fabricate",
        "tier": 3,
        "spellType": "Wizard",
        "duration": "10 rounds",
        "range": "Near",
        "description": "This spell can't target creatures. You turn a tree-sized collection of raw materials into a finished work. For example, you convert a pile of bricks or rocks into a bridge. The finished work converts back to raw materials when the spell ends."
    },
    {
        "source": "CR",
        "name": "Feather Fall",
        "tier": 1,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Self",
        "description": "You may make an attempt to cast this spell when you fall. Your rate of descent slows so that you land safely on your feet."
    },
    {
        "source": "CR",
        "name": "Fireball",
        "tier": 3,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Far",
        "description": "You hurl a small flame that erupts into a fiery blast. All creatures in a near-sized cube around where the flame lands take 4d6 damage."
    },
    {
        "source": "CR",
        "name": "Fixed Object",
        "tier": 2,
        "spellType": "Wizard",
        "duration": "5 rounds",
        "range": "Close",
        "description": "An object you touch that weighs no more than 5 pounds becomes fixed in its current location. It can support up to 5,000 pounds of weight for the duration of the spell."
    },
    {
        "source": "CR",
        "name": "Flame Strike",
        "tier": 4,
        "spellType": "Priest",
        "duration": "Instant",
        "range": "Far",
        "description": "You call down a holy pillar of fire, immolating one creature you can see within range. The target takes 2d6 damage."
    },
    {
        "source": "CR",
        "name": "Floating Disk",
        "tier": 1,
        "spellType": "Wizard",
        "duration": "10 rounds",
        "range": "Near",
        "description": "You create a floating, circular disk of force with a concave center. It can carry up to 20 gear slots. It hovers at waist level and automatically stays within near of you. It can’t cross over drop-offs or pits taller than a human."
    },
    {
        "source": "CR",
        "name": "Fly",
        "tier": 3,
        "spellType": "Wizard",
        "duration": "5 rounds",
        "range": "Self",
        "description": "Your feet lift from the ground, and you take to the air like a hummingbird. You can fly near for the spell's duration and are able to hover in place."
    },
    {
        "source": "CR",
        "name": "Gaseous Form",
        "tier": 3,
        "spellType": "Wizard",
        "duration": "10 rounds",
        "range": "Self",
        "description": "You and your gear turn into a cloud of smoke for the spell's duration. You can fly and pass through any gap that smoke could. You can sense the terrain and any movement around you out to a near distance. You can't cast spells while in this form."
    },
    {
        "source": "CR",
        "name": "Heal",
        "tier": 5,
        "spellType": "Priest",
        "duration": "Instant",
        "range": "Close",
        "description": "One creature you touch is healed to full hit points. You cannot cast this spell again until you complete a rest."
    },
    {
        "source": "CR",
        "name": "Hold Monster",
        "tier": 5,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Near",
        "description": "You paralyze one creature you can see within range. If the target is LV 9+, it may make a STR check vs. your last spellcasting check at the start of its turn to end the spell."
    },
    {
        "source": "CR",
        "name": "Hold Person",
        "tier": 2,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Near",
        "description": "You magically paralyze one humanoid creature of LV 4 or less you can see within range."
    },
    {
        "source": "CR",
        "name": "Hold Portal",
        "tier": 1,
        "spellType": "Wizard",
        "duration": "10 rounds",
        "range": "Near",
        "description": "You magically hold a portal closed for the duration. A creature must make a successful STR check vs. your spellcasting check to open the portal. The knock spell ends this spell."
    },
    {
        "source": "CR",
        "name": "Holy Weapon",
        "tier": 1,
        "spellType": "Priest",
        "duration": "5 rounds",
        "range": "Close",
        "description": "One weapon you touch is imbued with a sacred blessing. The weapon becomes magical and has +1 to attack and damage rolls for the duration."
    },
    {
        "source": "CR",
        "name": "Illusion",
        "tier": 3,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Far",
        "description": "You create a convincing visible and audible illusion that fills up to a near-sized cube in range. The illusion cannot cause harm, but creatures who believe the illusion is real react to it as though it were. A creature who inspects the illusion from afar must pass a Wisdom check vs. your last spellcasting check to perceive the false nature of the illusion. Touching the illusion also reveals its false nature."
    },
    {
        "source": "CR",
        "name": "Invisibility",
        "tier": 2,
        "spellType": "Wizard",
        "duration": "10 rounds",
        "range": "Close",
        "description": "A creature you touch becomes invisible for the spell’s duration. The spell ends if the target attacks or casts a spell."
    },
    {
        "source": "CR",
        "name": "Judgment",
        "tier": 5,
        "spellType": "Priest",
        "duration": "5 rounds",
        "range": "Close",
        "description": "You instantly banish a creature you touch, sending it and all possessions it carries to face the judgment of your god. You can banish an intelligent creature of LV 10 or less. When the creature returns in 5 rounds, it has been healed to full hit points if its deeds pleased your god. It has been reduced to 1 hit point if its deeds angered your god. If your god can't judge its actions, it is unchanged."
    },
    {
        "source": "CR",
        "name": "Knock",
        "tier": 2,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Near",
        "description": "A door, window, gate, chest, or portal you can see within range instantly opens, defeating all mundane locks and barriers. This spell creates a loud knock audible to all within earshot."
    },
    {
        "source": "CR",
        "name": "Lay To Rest",
        "tier": 3,
        "spellType": "Priest",
        "duration": "Instant",
        "range": "Close",
        "description": "You instantly send an undead creature you touch to its final afterlife, destroying it utterly. You can target an undead creature of LV 9 or less."
    },
    {
        "source": "CR",
        "name": "Levitate",
        "tier": 2,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Self",
        "description": "You can float a near distance vertically per round on your turn. You can also push against solid objects to move horizontally."
    },
    {
        "source": "CR",
        "name": "Light",
        "tier": 1,
        "spellType": "Priest, Wizard",
        "duration": "1 hour \nreal time",
        "range": "Close",
        "description": "One object you touch glows with bright, heatless light, illuminating out to a near distance for 1 hour of real time."
    },
    {
        "source": "CR",
        "name": "Lightning Bolt",
        "tier": 3,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Far",
        "description": "You shoot a blue-white ray of lightning from your hands, hitting all creatures in a straight line out to a far distance. Creatures struck by the lightning take 3d6 damage."
    },
    {
        "source": "CR",
        "name": "Mage Armor",
        "tier": 1,
        "spellType": "Wizard",
        "duration": "10 rounds",
        "range": "Self",
        "description": "An invisible layer of magical force protects your vitals. Your armor class becomes 14 (18 on a critical spellcasting check) for the spell’s duration."
    },
    {
        "source": "CR",
        "name": "Magic Circle",
        "tier": 3,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Near",
        "description": "Conjure a circle of runes around yourself and name a type of creature. Creatures of the chosen type cannot attack or cast hostile spells on anyone inside the circle, and can't possess, compel, or beguile anyone inside the circle."
    },
    {
        "source": "CR",
        "name": "Magic Missile",
        "tier": 1,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Far",
        "description": "You have advantage on your check to cast this spell. A glowing bolt of force streaks from your open hand, dealing 1d4 damage to one target."
    },
    {
        "source": "CR",
        "name": "Mass Cure",
        "tier": 3,
        "spellType": "Priest",
        "duration": "Instant",
        "range": "Near",
        "description": "All allies within near range of you regain 2d6 hit points."
    },
    {
        "source": "CR",
        "name": "Mirror Image",
        "tier": 2,
        "spellType": "Wizard",
        "duration": "5 rounds",
        "range": "Self",
        "description": "Create a number of illusory duplicates of yourself equal to half your level rounded down (minimum 1). Each time a creature attacks you, the attack misses and causes one of the duplicates to evaporate. If all the illusions have disappeared, the spell ends."
    },
    {
        "source": "CR",
        "name": "Misty Step",
        "tier": 2,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Self",
        "description": "In a puff of smoke, you teleport a near distance to an area you can see."
    },
    {
        "source": "CR",
        "name": "Passwall",
        "tier": 4,
        "spellType": "Wizard",
        "duration": "5 rounds",
        "range": "Close",
        "description": "A tunnel of your height opens in a barrier you touch and lasts for the duration. The passage can be up to near distance in length and must be in a straight line."
    },
    {
        "source": "CR",
        "name": "Pillar Of Salt",
        "tier": 4,
        "spellType": "Priest",
        "duration": "Focus",
        "range": "Near",
        "description": "A creature you target turns into a statue made of hardened salt. You can target a creature you can see of LV 5 or less. If you focus on this spell for 3 rounds in a row, the transformation becomes permanent."
    },
    {
        "source": "CR",
        "name": "Plane Shift",
        "tier": 5,
        "spellType": "Priest, Wizard",
        "duration": "Instant",
        "range": "Close",
        "description": "You fold space and time, transporting yourself and all willing creatures within close range to a location on another plane of your choice. Unless you have been to your intended location before, you appear in a random place on the destination plane."
    },
    {
        "source": "CR",
        "name": "Power Word Kill",
        "tier": 5,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Near",
        "description": "Utter the Word of Doom. One creature you target of LV 9 or less dies if it hears you. Treat a failed spellcasting check for this spell as a critical failure, and roll the mishap with disadvantage."
    },
    {
        "source": "CR",
        "name": "Prismatic Orb",
        "tier": 5,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Far",
        "description": "Send a strobing orb of energy streaking toward a target within range. Choose an energy type from fire, cold, or electricity. The orb deals 3d8 damage and delivers a concussive blast of the chosen energy type. If the energy type is anathema to the target's existence, the orb deals double damage to it."
    },
    {
        "source": "CR",
        "name": "Prophecy",
        "tier": 5,
        "spellType": "Priest",
        "duration": "Instant",
        "range": "Self",
        "description": "Commune directly with your god for guidance. Ask the GM one question. The GM answers the question truthfully using the knowledge your god possesses. You cannot cast this spell again until you complete penance."
    },
    {
        "source": "CR",
        "name": "Protection From Energy",
        "tier": 3,
        "spellType": "Wizard",
        "duration": "10 minutes",
        "range": "Close",
        "description": "One creature you touch becomes impervious to the wild fury of the elements. Choose fire, cold, or electricity. For the spell's duration, the target is immune to harm from energy of the chosen type."
    },
    {
        "source": "CR",
        "name": "Protection From Evil",
        "tier": 1,
        "spellType": "Priest, Wizard",
        "duration": "Focus",
        "range": "Close",
        "description": "For the spell's duration, chaotic beings have disadvantage on attack rolls and hostile spellcasting checks against the target. These beings also can't possess, compel, or beguile it. When cast on an already-possessed target, the possessing entity makes a CHA check vs. the last spellcasting check. On a failure, the entity is expelled."
    },
    {
        "source": "CR",
        "name": "Rebuke Unholy",
        "tier": 3,
        "spellType": "Priest",
        "duration": "Instant",
        "range": "Near",
        "description": "Rebuke creatures who oppose your alignment, forcing them to flee. You must present a holy symbol to cast this spell. If you are lawful or neutral, this spell affects demons, devils, and outsiders. If you are chaotic, this spell affects angels and natural creatures of the wild. Affected creatures within near of you must make a CHA check vs. your spellcasting check. If a creature fails by 10+ points and is equal to or less than your level, it is destroyed. Otherwise, on a fail, it flees from you for 5 rounds."
    },
    {
        "source": "CR",
        "name": "Regenerate",
        "tier": 4,
        "spellType": "Priest",
        "duration": "Focus",
        "range": "Close",
        "description": "A creature you touch regains 1d4 hit points on your turn for the duration. This spell also regrows lost body parts."
    },
    {
        "source": "CR",
        "name": "Resilient Sphere",
        "tier": 4,
        "spellType": "Wizard",
        "duration": "5 rounds",
        "range": "Close",
        "description": "You conjure a weightless, glassy sphere around you that extends out to close range. For the spell's duration, nothing can pass through or crush the sphere. You can roll the sphere a near distance on your turn."
    },
    {
        "source": "CR",
        "name": "Restoration",
        "tier": 3,
        "spellType": "Priest",
        "duration": "Instant",
        "range": "Close",
        "description": "With the touch of your hands, you expunge curses and illnesses. One curse, illness, or affliction of your choice affecting the target creature ends."
    },
    {
        "source": "CR",
        "name": "Sending",
        "tier": 3,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Unlimited",
        "description": "You send a brief, mental message to any creature with whom you are familiar who is on the same plane."
    },
    {
        "source": "CR",
        "name": "Shield Of Faith",
        "tier": 1,
        "spellType": "Priest",
        "duration": "5 rounds",
        "range": "Self",
        "description": "A protective force wrought of your holy conviction surrounds you. You gain a +2 bonus to your armor class for the duration."
    },
    {
        "source": "CR",
        "name": "Silence",
        "tier": 2,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Far",
        "description": "You magically mute sound in a near cube within the spell’s range. Creatures inside the area are deafened, and any sounds they create cannot be heard."
    },
    {
        "source": "CR",
        "name": "Sleep",
        "tier": 1,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Near",
        "description": "You weave a lulling spell that fills a near-sized cube extending from you. Living creatures in the area of effect fall into a deep sleep if they are LV 2 or less."
    },
    {
        "source": "CR",
        "name": "Smite",
        "tier": 2,
        "spellType": "Priest",
        "duration": "Instant",
        "range": "Near",
        "description": "You call down punishing flames on a creature you can see within range. It takes 1d6 damage."
    },
    {
        "source": "CR",
        "name": "Stoneskin",
        "tier": 4,
        "spellType": "Wizard",
        "duration": "10 rounds",
        "range": "Self",
        "description": "Your skin becomes like granite. For the spell's duration, your armor class becomes 17 (20 on a critical spellcasting check)."
    },
    {
        "source": "CR",
        "name": "Summon Extraplanar",
        "tier": 5,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Near",
        "description": "Reach into the outer planes and summon an elemental or outsider of LV 7 or less under your control. If you lose focus, you lose control and the creature becomes hostile towards you and your allies. A spellcasting check is required to return the creature to the outer planes."
    },
    {
        "source": "CR",
        "name": "Telekinesis",
        "tier": 4,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Far",
        "description": "Lift a creature or object weighing 1,000 pounds or less and move it in any direction or hold it in place."
    },
    {
        "source": "CR",
        "name": "Teleport",
        "tier": 5,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Close",
        "description": "Teleport yourself and willing creatures within close range to a specified location on your same plane with a 50% chance of arriving off-target if the location is unknown."
    },
    {
        "source": "CR",
        "name": "Turn Undead",
        "tier": 1,
        "spellType": "Priest",
        "duration": "Instant",
        "range": "Near",
        "description": "You rebuke undead creatures, forcing them to flee. You must present a holy symbol to cast this spell. \n\nUndead creatures within near of you must make a CHA check vs. your spellcasting check. If a creature fails by 10+ points and is equal to or less than your level, it is destroyed. Otherwise, on a fail, it flees from you for 5 rounds."
    },
    {
        "source": "CR",
        "name": "Wall Of Force",
        "tier": 4,
        "spellType": "Wizard",
        "duration": "5 rounds",
        "range": "Near",
        "description": "Conjures a contiguous, transparent wall of force in a near-sized area of your choice that blocks physical objects on the same plane."
    },
    {
        "source": "CR",
        "name": "Web",
        "tier": 2,
        "spellType": "Wizard",
        "duration": "5 rounds",
        "range": "Far",
        "description": "Creates a near-sized cube of sticky spider web within range. Creatures stuck in the web must succeed on a Strength check vs. your spellcasting check to free themselves."
    },
    {
        "source": "CR",
        "name": "Wish",
        "tier": 5,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Self",
        "description": "Alter reality with a single wish, interpreted by the GM. A failed spellcasting check is treated as a critical failure and rolls the mishap with disadvantage."
    },
    {
        "source": "CR",
        "name": "Wrath",
        "tier": 4,
        "spellType": "Priest",
        "duration": "10 rounds",
        "range": "Self",
        "description": "Weapons become magical +2 and deal an additional d8 damage for the spell's duration."
    },
    {
        "source": "CR",
        "name": "Zone Of Truth",
        "tier": 2,
        "spellType": "Priest",
        "duration": "Focus",
        "range": "Near",
        "description": "Compel a creature you can see to speak the truth while within range. They cannot utter a deliberate lie."
    },
    {
        "source": "CR",
        "name": "Alter Self",
        "tier": 2,
        "spellType": "Wizard",
        "duration": "5 rounds",
        "range": "Self",
        "description": "You magically change your physical form, gaining one feature that modifies your existing anatomy. For example, you can grow functional gills on your neck or bear claws on your fingers. This spell can’t grow wings or limbs."
    },
    {
        "source": "CR",
        "name": "Augury",
        "tier": 2,
        "spellType": "Priest",
        "duration": "Instant",
        "range": "Self",
        "description": "You interpret the meaning of supernatural portents and omens. Ask the GM one question about a specific course of action. The GM says whether the action will lead to “weal” or “woe.”"
    },
    {
        "source": "CR",
        "name": "Charm Person",
        "tier": 1,
        "spellType": "Wizard",
        "duration": "1d8 days",
        "range": "Near",
        "description": "You magically beguile one humanoid of LV 2 or less within near range, who regards you as a friend for the duration. The spell ends if you or your allies do anything harmful to the target. The target knows it was magically charmed after the spell ends."
    },
    {
        "source": "CR",
        "name": "Dimension Door",
        "tier": 4,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Self",
        "description": "You teleport yourself and up to one other willing creature to any point you can see."
    },
    {
        "source": "CR",
        "name": "Divination",
        "tier": 4,
        "spellType": "Wizard",
        "duration": "Instant",
        "range": "Self",
        "description": "You throw the divining bones or peer into the blackness between the stars, seeking a portent. You can ask the GM one yes or no question. The GM truthfully answers \"yes\" or \"no.\" If you cast this spell more than once in 24 hours, treat a failed spellcasting check for it as a critical failure, instead."
    },
    {
        "source": "CR",
        "name": "Polymorph",
        "tier": 4,
        "spellType": "Wizard",
        "duration": "10 rounds",
        "range": "Touch",
        "description": "You transform a creature you touch into another natural creature you choose of equal or smaller size. Any gear the target carries melds into its new form. The target gains the creature's hit points, armor class, and attacks, but retains its intellect. If the target goes to 0 hit points, it reverts to its true form at half its prior hit points. You can target any willing creature with this spell, or an unwilling creature whose level is less than or equal to half your level rounded down (minimum 1)."
    },
    {
        "source": "CR",
        "name": "Scrying",
        "tier": 5,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Self",
        "description": "You look into a crystal ball or reflecting pool, calling up images of a distant place. For the spell's duration, you can see and hear a creature or location you choose that is on the same plane. This spell is DC 18 to cast if you try to scry on a creature or location that is unfamiliar to you. Each round, creatures you view may make a Wisdom check vs. your last spellcasting check. On a success, they become aware of your magical observation."
    },
    {
        "source": "CR",
        "name": "Shapechange",
        "tier": 5,
        "spellType": "Wizard",
        "duration": "Focus",
        "range": "Self",
        "description": "You transform yourself and any gear you carry into another natural creature you've seen of level 10 or less. You gain the creature's hit points, armor class, and attacks, but retain your intellect. If you go to 0 hit points while under the effects of this spell, you revert to your true form at 1 hit point."
    },
    {
        "source": "CR",
        "name": "Speak With Dead",
        "tier": 3,
        "spellType": "Priest, Wizard",
        "duration": "Instant",
        "range": "Close",
        "description": "A dead body you touch answers your questions in a distant, wheezing voice. You can ask the dead body up to three yes or no questions (one at a time). The GM truthfully answers \"yes\" or \"no\" to each. If you cast this spell more than once in 24 hours, treat a failed spellcasting check for it as a critical failure, instead."
    }
]